function D=Data10
no_num=10;
Coord=360*[0 1 0;1 1 0;2 1 0;0 0 0;1 0 0;2 0 0]; 
Con=[1 2;2 3;4 5;5 6;2 5;3 6;1 5;2 4;2 6;3 5];
Re=[1 1 1;0 0 1;0 0 1;1 1 1;0 0 1;0 0 1];
Load=zeros(size(Coord));Load(5,:)=[0 -1e5 0];Load(6,:)=[0 -1e5 0];
A=[33.5 1.62 22.9 14.2 1.62 1.62 7.97 22.90 22.0 1.62 ];

% Coord=360*[2 1 0;2 0 0;1 1 0;1 0 0;0 1 0;0 0 0]; 
% Con=[5 3;1 3;6 4;4 2;4 3;2 1;6 3;5 4;4 1;3 2];
% Re=[0 0 1;0 0 1;0 0 1;0 0 1;1 1 1;1 1 1];
% Load=zeros(size(Coord));Load(2,:)=[0 -1e5 0];Load(4,:)=[0 -1e5 0];
% A=[33.5 1.62 22.9 14.2 1.62 1.62 22.90 7.97 1.62 22.0];


E=ones(1,size(Con,1))*1e7;
% or:   E=[1 1 1 1 1 1 1 1 1 1]*1e7;

% D=struct('Coord',Coord','Con',Con','Re',Re','Load',Load','E',E','A',A');

  
% S_X=[1:max(size(T)];
% S_Y=[1:max(size(T)];
S_X=[ ];  %因为力是Y向，X向刚度起不到什么作用
% S_Y=[1 3 4 7 8 9];  % 得到Y向刚度
% S_Y=[7 8 9];  % 7 8 9 是桁架结构
S_Y=[9,4, 7] ;%9是上部的桁架 4也是上部的杆件，且9的经济性>4 然后第三个选7/8 跟我25杆件犹豫 6和7 一个道理。
S=S_Y; %

p=0.1;T=[1 1 1 1 1 1 1 1 1 1];
F_limit=25;U_limit=2;
Area=[1.62  1.80 1.99 2.13 2.38 2.62 2.63 2.88 2.93 3.09 3.13 3.38 3.47 ...
    3.55 3.63 3.84 3.87 3.88 4.18 4.22 4.49 4.59 4.8 4.97 5.12....
    5.74 7.22 7.97 11.5 13.5 13.9 14.2 15.5 16.0 16.9 18.8 19.9...
    22.0 22.9 26.5 30.0 33.5];

D=struct('Coord',Coord','Con',Con','Re',Re','Load',Load','E',E','A',A',...
    'p',p,'U_limit',U_limit,'F_limit',F_limit,'Area',Area,'T',T,'S_X',S_X,'S_Y',S_Y,'S',S,'No',no_num);
